In [ ]:
mot = 'totoro'
mot_inverse = ""

for i in range(len(mot) - 1, -1, -1):
    mot_inverse += mot[i]
    print(mot_inverse), print(i)

print(len(mot))

print(list(range(4,-1,-1)))

o
5
or
4
oro
3
orot
2
oroto
1
orotot
0
6
[4, 3, 2, 1, 0]

In [12]:
import pandas as pd

df = pd.read_csv('university_rank.csv')

df.head(10)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011
5,6,University of Cambridge,United Kingdom,90.5,77.7,94.1,94.0,57.0,91.2,"18,812",11.8,34%,46 : 54,2011
6,6,University of Oxford,United Kingdom,88.2,77.2,93.9,95.1,73.5,91.2,"19,919",11.6,34%,46 : 54,2011
7,8,"University of California, Berkeley",United States of America,84.2,39.6,99.3,97.8,-,91.1,"36,186",16.4,15%,50 : 50,2011
8,9,Imperial College London,United Kingdom,89.2,90.0,94.5,88.3,92.9,90.6,"15,060",11.7,51%,37 : 63,2011
9,10,Yale University,United States of America,92.1,59.2,89.7,91.5,-,89.5,"11,751",4.4,20%,50 : 50,2011

In [ ]:
ratings = [['Loris', 71], ['Luca', 85], ['Marco', 90], ['Giulia', 95], ['Sara', 80]]

maximum_index = 0
maximum = 0

for i, j, in enumerate(ratings):

    print("DANS LA BOUCLE FOR -->l'increment i est :", i, "le joueur est", j[0], "avec une note =", float(j[1]))

    if float(j[1]) > maximum:
        maximum = float(j[1])
        maximum_index = i
        print("DANS LE IF :le nouveau maximum est :", maximum, "et il a été atteint par", j[0], "à l'indice", maximum_index, "\n")

    else:
        print("DANS LE ELSE :le joueur", j[0], "n'a pas atteint le nouveau maximum de", maximum, "\n")

DANS LA BOUCLE FOR -->l'increment i est : 0 le joueur est Loris avec une note = 71.0
DANS LE IF :le nouveau maximum est : 71.0 et il a été atteint par Loris à l'indice 0

DANS LA BOUCLE FOR -->l'increment i est : 1 le joueur est Luca avec une note = 85.0
DANS LE IF :le nouveau maximum est : 85.0 et il a été atteint par Luca à l'indice 1

DANS LA BOUCLE FOR -->l'increment i est : 2 le joueur est Marco avec une note = 90.0
DANS LE IF :le nouveau maximum est : 90.0 et il a été atteint par Marco à l'indice 2

DANS LA BOUCLE FOR -->l'increment i est : 3 le joueur est Giulia avec une note = 95.0
DANS LE IF :le nouveau maximum est : 95.0 et il a été atteint par Giulia à l'indice 3

DANS LA BOUCLE FOR -->l'increment i est : 4 le joueur est Sara avec une note = 80.0
DANS LE ELSE :le joueur Sara n'a pas atteint le nouveau maximum de 95.0

In [ ]:
import numpy as np  

ratings = [1, 2, 3, 4, 0, 5, 6, 7, 8, 9, 0, 10]
ratings2 = [1, 2, 24, 4, 0, 53, 66, 7, 8, 9, 0, 10]



def moyenne_sans_zero(notes):
    notes_no_zero = np.array(notes)[np.array(notes) != 0]
    return notes_no_zero.mean()


# utilisont la fonction moyenne_sans_zero
print("mon premier match à comme moyenne", moyenne_sans_zero(ratings), "et mon second match à comme moyenne", moyenne_sans_zero(ratings2))

mon premier match à comme moyenne 5.5 et mon second match à comme moyenne 18.4

In [10]:
ma_liste = [1, 2, 3, 4, 5, 6, 7, 8, 9, 1000]

moyenne_sans_zero(ma_liste)

104.5

In [13]:
import pandas as pd

df = pd.DataFrame({
'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
'col2': [2, 1, 9, 8, 7, 4],
'col3': [0, 1, 9, 4, 2, 3],
'col4': ['a', 'B', 'c', 'D', 'e', 'F']
 })

In [ ]:
df.sort_values(by='col1')

np.

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [4]:
matrice = [[1., 0., 0.],
            [0., 1., 2.]]

une_liste = [1., 2., 3.]

In [5]:
type(matrice)
type(une_liste)

list

In [7]:
import numpy as np

matrice = np.array(matrice)
type(matrice)

numpy.ndarray